###################################################################

# Created by write_sdc on Sun Nov 10 21:04:13 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.5 [current_design]
set_max_transition 1.5 [current_design]
set_load -pin_load 0.2 [get_ports {read_data[7]}]
set_load -pin_load 0.2 [get_ports {read_data[6]}]
set_load -pin_load 0.2 [get_ports {read_data[5]}]
set_load -pin_load 0.2 [get_ports {read_data[4]}]
set_load -pin_load 0.2 [get_ports {read_data[3]}]
set_load -pin_load 0.2 [get_ports {read_data[2]}]
set_load -pin_load 0.2 [get_ports {read_data[1]}]
set_load -pin_load 0.2 [get_ports {read_data[0]}]
set_load -pin_load 0.2 [get_ports fifo_full]
set_load -pin_load 0.2 [get_ports fifo_empty]
set_max_fanout 1 [get_ports write_clk]
set_max_fanout 1 [get_ports write_rst_n]
set_max_fanout 1 [get_ports {write_data[7]}]
set_max_fanout 1 [get_ports {write_data[6]}]
set_max_fanout 1 [get_ports {write_data[5]}]
set_max_fanout 1 [get_ports {write_data[4]}]
set_max_fanout 1 [get_ports {write_data[3]}]
set_max_fanout 1 [get_ports {write_data[2]}]
set_max_fanout 1 [get_ports {write_data[1]}]
set_max_fanout 1 [get_ports {write_data[0]}]
set_max_fanout 1 [get_ports write_enable]
set_max_fanout 1 [get_ports read_clk]
set_max_fanout 1 [get_ports read_rst_n]
set_max_fanout 1 [get_ports read_enable]
create_clock [get_ports write_clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks write_clk]
set_clock_uncertainty -setup 0.7  [get_clocks write_clk]
set_clock_uncertainty -hold 0.5  [get_clocks write_clk]
set_clock_transition -max -rise 0.1 [get_clocks write_clk]
set_clock_transition -min -rise 0.1 [get_clocks write_clk]
set_clock_transition -max -fall 0.12 [get_clocks write_clk]
set_clock_transition -min -fall 0.12 [get_clocks write_clk]
create_clock [get_ports read_clk]  -period 17  -waveform {0 8.5}
set_clock_latency 1  [get_clocks read_clk]
set_clock_uncertainty -setup 0.7  [get_clocks read_clk]
set_clock_uncertainty -hold 0.5  [get_clocks read_clk]
set_clock_transition -max -rise 0.1 [get_clocks read_clk]
set_clock_transition -min -rise 0.1 [get_clocks read_clk]
set_clock_transition -max -fall 0.12 [get_clocks read_clk]
set_clock_transition -min -fall 0.12 [get_clocks read_clk]
create_clock -name v_write_clk  -period 10  -waveform {0 5}
create_clock -name v_read_clk  -period 17  -waveform {0 8.5}
set_false_path   -from [get_clocks write_clk]  -to [get_clocks read_clk]
set_false_path   -from [get_clocks read_clk]  -to [get_clocks write_clk]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[7]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[6]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[5]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[4]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[3]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[2]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[1]}]
set_input_delay -clock v_write_clk  1  [get_ports {write_data[0]}]
set_input_delay -clock v_write_clk  1  [get_ports write_enable]
set_input_delay -clock v_read_clk  1  [get_ports read_enable]
set_output_delay -clock v_write_clk  1  [get_ports fifo_full]
set_output_delay -clock v_read_clk  1  [get_ports fifo_empty]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[7]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[6]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[5]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[4]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[3]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[2]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[1]}]
set_output_delay -clock v_read_clk  1  [get_ports {read_data[0]}]
set_input_transition -max -rise 0.1  [get_ports write_clk]
set_input_transition -max -fall 0.12  [get_ports write_clk]
set_input_transition -min -rise 0.1  [get_ports write_clk]
set_input_transition -min -fall 0.12  [get_ports write_clk]
set_input_transition -max -rise 0.1  [get_ports write_rst_n]
set_input_transition -max -fall 0.12  [get_ports write_rst_n]
set_input_transition -min -rise 0.1  [get_ports write_rst_n]
set_input_transition -min -fall 0.12  [get_ports write_rst_n]
set_input_transition -max -rise 0.1  [get_ports {write_data[7]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[7]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[7]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[7]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[6]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[6]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[6]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[6]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[5]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[5]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[5]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[5]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[4]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[4]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[4]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[4]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[3]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[3]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[3]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[3]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[2]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[2]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[2]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[2]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[1]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[1]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[1]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[1]}]
set_input_transition -max -rise 0.1  [get_ports {write_data[0]}]
set_input_transition -max -fall 0.12  [get_ports {write_data[0]}]
set_input_transition -min -rise 0.1  [get_ports {write_data[0]}]
set_input_transition -min -fall 0.12  [get_ports {write_data[0]}]
set_input_transition -max -rise 0.1  [get_ports write_enable]
set_input_transition -max -fall 0.12  [get_ports write_enable]
set_input_transition -min -rise 0.1  [get_ports write_enable]
set_input_transition -min -fall 0.12  [get_ports write_enable]
set_input_transition -max -rise 0.1  [get_ports read_clk]
set_input_transition -max -fall 0.12  [get_ports read_clk]
set_input_transition -min -rise 0.1  [get_ports read_clk]
set_input_transition -min -fall 0.12  [get_ports read_clk]
set_input_transition -max -rise 0.1  [get_ports read_rst_n]
set_input_transition -max -fall 0.12  [get_ports read_rst_n]
set_input_transition -min -rise 0.1  [get_ports read_rst_n]
set_input_transition -min -fall 0.12  [get_ports read_rst_n]
set_input_transition -max -rise 0.1  [get_ports read_enable]
set_input_transition -max -fall 0.12  [get_ports read_enable]
set_input_transition -min -rise 0.1  [get_ports read_enable]
set_input_transition -min -fall 0.12  [get_ports read_enable]
